Core/src/Documents/LT_СоответствияДанныхDMS/LT_СоответствияДанныхDMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LT_СоответствияДанныхDMS</name>
  <registerRecords>InformationRegister.LT_КатегорииЗапасов</registerRecords>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.LT_СоответствияУслуг99</registerRecords>
  <registerRecords>InformationRegister.LT_НаправленияДеятельностиЗапасов</registerRecords>
  <registerRecords>InformationRegister.LT_КатегорияУслуги</registerRecords>
  <registerRecords>InformationRegister.LT_НаправленияДеятельностиУслуг</registerRecords>
  <registerRecords>InformationRegister.LT_ГруппаЗапасов</registerRecords>
  <registerRecords>InformationRegister.LT_СоответствияБанковскихСчетовКассы</registerRecords>
  <attributes>
    <name>КатегорияУслуги</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>LT_КатегорииЗапасов</name>
    <attributes>
      <name>InventoryPostingGroup</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MakeCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitOfMeasure</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LT_СоответствияУслуг99</name>
    <attributes>
      <name>DescriptionOfInstruction</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LT_СоответствияБанковскихСчетов</name>
    <attributes>
      <name>POS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКасса</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LT_НаправленияДеятельностиЗапасов</name>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LT_СоответствияУслуг</name>
    <attributes>
      <name>DescriptionOfInstruction</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправленияДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LT_ГруппаЗапасов</name>
    <attributes>
      <name>DescriptionOfInstruction</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/LT_КатегорииЗапасов/LT_КатегорииЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_КатегорииЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>InventoryPostingGroup</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>MakeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UnitOfMeasure</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_СоответствияУслуг99/LT_СоответствияУслуг99.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_СоответствияУслуг99</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_СоответствияБанковскихСчетовКассы/LT_СоответствияБанковскихСчетовКассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_СоответствияБанковскихСчетовКассы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </resources>
  <dimensions>
    <name>POS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_КатегорияУслуги/LT_КатегорияУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_КатегорияУслуги</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_НаправленияДеятельностиЗапасов/LT_НаправленияДеятельностиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_НаправленияДеятельностиЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_НаправленияДеятельностиУслуг/LT_НаправленияДеятельностиУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_НаправленияДеятельностиУслуг</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/LT_ГруппаЗапасов/LT_ГруппаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>LT_ГруппаЗапасов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>DescriptionOfInstruction</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/LT_СоответствияДанныхDMS/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)


	// регистр LT_СоответствияКатегорииЗапасов
	Движения.LT_КатегорииЗапасов.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияКатегории Из LT_КатегорииЗапасов Цикл
		Движение = Движения.LT_КатегорииЗапасов.Добавить();
		Движение.Период = Дата;
		Движение.InventoryPostingGroup = ТекСтрокаСоответствияКатегории.InventoryPostingGroup;
		Движение.MakeCode = ТекСтрокаСоответствияКатегории.MakeCode;
		Движение.UnitOfMeasure = ТекСтрокаСоответствияКатегории.UnitOfMeasure;
		Движение.Категория = ТекСтрокаСоответствияКатегории.Категория;
	КонецЦикла;

	// регистр LT_СоответствияDescriptionOfInstruction
	Движения.LT_СоответствияУслуг99.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияDescriptionOfInstruction Из LT_СоответствияУслуг99 Цикл
		Движение = Движения.LT_СоответствияУслуг99.Добавить();
		Движение.Период = Дата;
		Движение.DescriptionOfInstruction = ТекСтрокаСоответствияDescriptionOfInstruction.DescriptionOfInstruction;
		Движение.Номенклатура = ТекСтрокаСоответствияDescriptionOfInstruction.Номенклатура;
	КонецЦикла;

	// регистр LT_СоответствияPOS
	Движения.LT_СоответствияБанковскихСчетовКассы.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияPOS Из LT_СоответствияБанковскихСчетов Цикл
		Движение = Движения.LT_СоответствияБанковскихСчетовКассы.Добавить();
		Движение.Период 				= Дата;
		Движение.POS 					= ТекСтрокаСоответствияPOS.POS;
		Движение.БанковскийСчетКасса 	= ТекСтрокаСоответствияPOS.БанковскийСчетКасса;
	КонецЦикла;

	// регистр LT_КатегорияУслуги
	Движения.LT_КатегорияУслуги.Записывать = Истина;
	Если ЗначениеЗаполнено(КатегорияУслуги) Тогда
		Движение = Движения.LT_КатегорияУслуги.Добавить();
		Движение.Период = Дата;
		Движение.Категория = КатегорияУслуги;
	КонецЕсли;

	// регистр LT_НаправленияДеятельностиЗапасов
	Движения.LT_НаправленияДеятельностиЗапасов.Записывать = Истина;
	Для Каждого ТекСтрокаНаправленияДеятельностиЗапасов Из LT_НаправленияДеятельностиЗапасов Цикл
		Движение = Движения.LT_НаправленияДеятельностиЗапасов.Добавить();
		Движение.Период 					= Дата;
		Движение.КатегорияНоменклатуры 		= ТекСтрокаНаправленияДеятельностиЗапасов.КатегорияНоменклатуры;
		Движение.НаправлениеДеятельности 	= ТекСтрокаНаправленияДеятельностиЗапасов.НаправлениеДеятельности;
	КонецЦикла;
	
	// регистр LT_НаправленияДеятельностиУслуг
	Движения.LT_НаправленияДеятельностиУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаСоответствияDescriptionOfInstruction Из LT_СоответствияУслуг Цикл
		Движение = Движения.LT_НаправленияДеятельностиУслуг.Добавить();
		Движение.Период = Дата;
		Движение.DescriptionOfInstruction = ТекСтрокаСоответствияDescriptionOfInstruction.DescriptionOfInstruction;
		Движение.НаправлениеДеятельности = ТекСтрокаСоответствияDescriptionOfInstruction.НаправленияДеятельности;
	КонецЦикла;
	
	Движения.LT_ГруппаЗапасов.Записывать = Истина;
	Для Каждого ТекГруппаЗапасов Из LT_ГруппаЗапасов Цикл
		Движение = Движения.LT_ГруппаЗапасов.Добавить();
		Движение.Период 					= Дата;
		Движение.DescriptionOfInstruction 	= ТекГруппаЗапасов.DescriptionOfInstruction;
		Движение.Группа 	                = ТекГруппаЗапасов.Группа;
	КонецЦикла;

КонецПроцедуры
